{"format": "layers-model", "generatedBy": "keras v3.0.5", "convertedBy": "TensorFlow.js Converter v4.17.0", "modelTopology": {"keras_version": "3.0.5", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "dcnn", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, null], "dtype": "float32", "sparse": false, "name": "input_text"}, "name": "input_text", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding", "trainable": true, "dtype": "float32", "input_dim": 1879, "output_dim": 128, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false}, "name": "embedding", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, null], "dtype": "float32", "keras_history": ["input_text", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv1D", "config": {"name": "conv1d", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, null, 128], "dtype": "float32", "keras_history": ["embedding", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv1D", "config": {"name": "conv1d_1", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, null, 128], "dtype": "float32", "keras_history": ["embedding", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv1D", "config": {"name": "conv1d_2", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, null, 128], "dtype": "float32", "keras_history": ["embedding", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv1D", "config": {"name": "conv1d_3", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_3", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, null, 128], "dtype": "float32", "keras_history": ["embedding", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv1D", "config": {"name": "conv1d_4", "trainable": true, "dtype": "float32", "filters": 100, "kernel_size": [4], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_4", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, null, 128], "dtype": "float32", "keras_history": ["embedding", 0, 0]}}], "kwargs": {}}]}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_max_pooling1d", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, null, 100], "dtype": "float32", "keras_history": ["conv1d", 0, 0]}}], "kwargs": {}}]}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_max_pooling1d_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, null, 100], "dtype": "float32", "keras_history": ["conv1d_1", 0, 0]}}], "kwargs": {}}]}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_2", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_max_pooling1d_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, null, 100], "dtype": "float32", "keras_history": ["conv1d_2", 0, 0]}}], "kwargs": {}}]}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_3", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_max_pooling1d_3", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, null, 100], "dtype": "float32", "keras_history": ["conv1d_3", 0, 0]}}], "kwargs": {}}]}, {"class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_4", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_max_pooling1d_4", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, null, 100], "dtype": "float32", "keras_history": ["conv1d_4", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 100], "dtype": "float32", "keras_history": ["global_max_pooling1d", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 100], "dtype": "float32", "keras_history": ["global_max_pooling1d_1", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 100], "dtype": "float32", "keras_history": ["global_max_pooling1d_2", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 100], "dtype": "float32", "keras_history": ["global_max_pooling1d_3", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 100], "dtype": "float32", "keras_history": ["global_max_pooling1d_4", 0, 0]}}]], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 500], "dtype": "float32", "keras_history": ["concatenate", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.2, "seed": null, "noise_shape": null}, "name": "dropout", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 512], "dtype": "float32", "keras_history": ["dense", 0, 0]}}], "kwargs": {"training": false}}]}, {"class_name": "Dense", "config": {"name": "output", "trainable": true, "dtype": "float32", "units": 5, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "output", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 512], "dtype": "float32", "keras_history": ["dropout", 0, 0]}}], "kwargs": {}}]}], "input_layers": [["input_text", 0, 0]], "output_layers": [["output", 0, 0]]}}, "training_config": {"loss": "binary_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": false, "optimizer_config": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0010000000474974513, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv1d/conv1d/kernel", "shape": [2, 128, 100], "dtype": "float32"}, {"name": "conv1d/conv1d/bias", "shape": [100], "dtype": "float32"}, {"name": "conv1d_1/conv1d_1/kernel", "shape": [3, 128, 100], "dtype": "float32"}, {"name": "conv1d_1/conv1d_1/bias", "shape": [100], "dtype": "float32"}, {"name": "conv1d_2/conv1d_2/kernel", "shape": [3, 128, 100], "dtype": "float32"}, {"name": "conv1d_2/conv1d_2/bias", "shape": [100], "dtype": "float32"}, {"name": "conv1d_3/conv1d_3/kernel", "shape": [4, 128, 100], "dtype": "float32"}, {"name": "conv1d_3/conv1d_3/bias", "shape": [100], "dtype": "float32"}, {"name": "conv1d_4/conv1d_4/kernel", "shape": [4, 128, 100], "dtype": "float32"}, {"name": "conv1d_4/conv1d_4/bias", "shape": [100], "dtype": "float32"}, {"name": "dense/dense/kernel", "shape": [500, 512], "dtype": "float32"}, {"name": "dense/dense/bias", "shape": [512], "dtype": "float32"}, {"name": "embedding/embedding/embeddings", "shape": [1879, 128], "dtype": "float32"}, {"name": "output/output/kernel", "shape": [512, 5], "dtype": "float32"}, {"name": "output/output/bias", "shape": [5], "dtype": "float32"}]}]}